In [4]:
import pandas as pd
import numpy as np

In [5]:
from sqlalchemy import create_engine

In [6]:
temp_db = create_engine('sqlite:///:memory:')  # Временная база данных в памяти компьютера

In [9]:
df = pd.DataFrame(data=np.random.randint(low=0, high=100, size=(4, 4)), columns=['a', 'b', 'c', 'd'])

In [10]:
df

    a   b   c   d
0  92  72  94  96
1  22  20  80  19
2  54  22  51  72
3  13  18  18  89

In [15]:
df.to_sql(name='new_table', con=temp_db, if_exists='replace')  # Создание новой таблицы в базе данных

4

In [18]:
new_df = pd.read_sql(sql='new_table', con=temp_db)

In [19]:
new_df

   index   a   b   c   d
0      0  92  72  94  96
1      1  22  20  80  19
2      2  54  22  51  72
3      3  13  18  18  89

In [20]:
result = pd.read_sql_query(sql='SELECT a, c FROM new_table', con=temp_db)

In [21]:
result

    a   c
0  92  94
1  22  80
2  54  51
3  13  18